cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'd12frosted/emacs-plus'

brew 'ag'
brew 'emacs-plus', args:['with-native-comp', 'with-spacemacs-icon', 'with-imagemagick']
brew 'grpcurl'
brew 'htop'
brew 'ispell'
brew 'jq'
brew 'packer'
brew 'step'
brew 'tig'
brew 'tmux'
brew 'wget'

cask '1password-cli'
cask 'chef-workstation'
cask 'visual-studio-code'
cask 'zoom'
cask 'zed'
