cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'd12frosted/emacs-plus'
tap 'etsy/terraform-demux', 'https://github.com/etsy/terraform-demux'

brew 'ag'
brew 'bazel'
brew 'bazelisk'
brew 'buildifier'
brew 'emacs-plus', args:['with-native-comp', 'with-spacemacs-icon', 'with-imagemagick']
brew 'gh'
brew 'grpcurl'
brew 'htop'
brew 'ispell'
brew 'jenv'
brew 'jsonnet'
brew 'jq'
brew 'maven'
brew 'packer'
brew 'step'
brew 'etsy/terraform-demux/terraform-demux'
brew 'tig'
brew 'tmux'
brew 'wget'

cask '1password-cli'
cask 'chef-workstation'
cask 'raycast'
cask 'visual-studio-code'
cask 'zoom'
cask 'zed'
